W11D5/pokedex-rails-backend/app/controllers/api/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."pokemon_id" = $1 LIMIT $2  [["pokemon_id", 1], ["LIMIT", 1]]
---
  def index
    pokemon_id = params[:pokemon_id]
    @items = Item.where(pokemon_id: pokemon_id)