W6D5/ninety_nine_cats/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = $1, "color" = $2, "name" = $3, "sex" = $4, "description" = $5, "updated_at" = $6 WHERE "cats"."id" = $7  [["birth_date", "2022-05-15"], ["color", "green"], ["name", "Catty2"], ["sex", "F"], ["description", "another test"], ["updated_at", "2022-08-26 20:55:14.415910"], ["id", 2]]
---
    def update
        @cat = Cat.find(params[:id])
        if @cat.update(cat_params)