W11D5/pokedex-rails-backend/app/views/api/pokemon/show.json.jbuilder

SELECT "moves".* FROM "moves" INNER JOIN "poke_moves" ON "moves"."id" = "poke_moves"."move_id" WHERE "poke_moves"."pokemon_id" = $1  [["pokemon_id", 4]]
---
json.type @pokemon.poke_type
json.moves @pokemon.moves.map {|move| move.name}