W6D4/first_routes_and_controllers/app/controllers/ArtworkSharesController.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 5], ["viewer_id", 6], ["created_at", "2022-08-25 19:42:46.015410"], ["updated_at", "2022-08-25 19:42:46.015410"]]
---
    def create
        @asc = ArtworkShare.new(asc_params)
        if @asc.save!

SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 4]]
SELECT "artwork_shares".* FROM "artwork_shares"
---
    def destroy
        @asc = ArtworkShare.find(params[:id])
        @asc.destroy
        @all_asc = ArtworkShare.all