W6D4/first_routes_and_controllers/app/controllers/ArtworksController.rb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "artworks" SET "image_url" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["image_url", "test.test.test"], ["updated_at", "2022-08-25 19:20:26.814915"], ["id", 7]]
---
    def update
        @artwork = Artwork.find(params[:id])
        if @artwork.update(artwork_params)

INSERT INTO "artworks" ("title", "image_url", "created_at", "updated_at", "artist_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test"], ["image_url", "test.test"], ["created_at", "2022-08-25 19:20:05.454718"], ["updated_at", "2022-08-25 19:20:05.454718"], ["artist_id", 4]]
---
    def create
        @artwork = Artwork.new(artwork_params)
        if @artwork.save!