W6D4/first_routes_and_controllers/app/controllers/UsersController.rb

    def create
        @user = User.new(user_params)
        if @user.save!
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Eugene"], ["email", "whatever"], ["created_at", "2022-08-25 13:12:52.764782"], ["updated_at", "2022-08-25 13:12:52.764782"]]